Tekla.Structures.CatalogInternal.ImportFromMetadata
The structure specifying the source of importing a shape from the metadata  in an XML file.

Tekla.Structures.CatalogInternal.ImportFromMetadata.#ctor
Initializes a new instance of the Tekla.Structures.CatalogInternal.ImportFromMetadata class.

Tekla.Structures.CatalogInternal.ImportFromMetadata.GetSchema
Gets the metadata schema which can be used to validate the metadata in XML.
Returns: The schema string.

Tekla.Structures.CatalogInternal.ImportFromMetadata.ToStruct
Creates an instance in internal struct.
Returns:
The Tekla.Structures.CatalogInternal.dotcatShapeImport_t.